<?php
/*
 * Task 30. Найти максимальный элемент без использования if/else и других операторов сравнения
 * Задача: Даны два целых числа. Написать функцию, ктр возвращает максимальный элемент без использования
 * цикла if/else и других операторов сравнения.
 *
 * Решение: если представить числовую прямую и на ней два числа А и В, то можно понять:
 *
 *        a + b - |a - b|               a + b + |a - b|
 * min = -----------------       max = -----------------
 *            2                               2
 */

