<?php
/**
 * Created by PhpStorm.
 * User: Иван
 * Date: 08.10.2018
 * Time: 18:19
 * Задача: Дан отсортированный по возрастанию, но циклически сдвинутый массив.
 * Нужно вывести индекс заданного элемента X (если такой элемент есть) в массиве.
 * Пример: [9, 10, 11, 1, 2, 3, 4, 5, 6, 7, 8]; X = 8
 * Вывод: 10
 */

function findIndex($arr, $x){
    $i = 0;
    $j = count($arr) - 1;
    while (($j-$i)>1){
        $k = floor(($j+$i) / 2);
		//echo "$i  $k  $j  <br/>";
		//echo "$arr[$i]  $arr[$k]  $arr[$j]  <br/><br/><br/>";
		// Если искомый элемент в левой части, то j=k
        $slm = (($arr[$i] <= $arr[$k]) && // максимальный элемент слева от центра
            ($arr[$i] <= $x) && // искомый между первым 
            ($x <= $arr[$k]));  // 		и центром
			
			
        $sgm = (($arr[$i]>=$arr[$k]) && // максимальный элемент справа от центра
            ((($x >= $arr[$i]) && ($x >= $arr[$k]))|| // скомый справа от центра i = k
            (($x <= $arr[$i]) && ($x <= $arr[$k])))); // скомый справа от центра i = k
        if ($slm || $sgm){
            $j = $k;
        } else $i = $k;
    }

		//echo "$i  $j  <br/>";
		//echo "$arr[$i]  $arr[$j]  <br/><br/><br/>";
    
	return ($arr[$i] == $x) ? $i :
        (($arr[$j] == $x) ? $j : -1);
}

$arr1 = array(9,1,2,3,4,5,6,7,8);
$arr2 = array(3,4,5,6,7,8,9,1,2);
$arr3 = array(2,1,1,1,1,1,1,1,1);
$arr4 = array(2,1,1,1,1,1,1,1,2);

//echo findIndex($arr1, 9);


echo findIndex($arr1, 9)."<br/>".
    findIndex($arr2, 5)."<br/>".
    findIndex($arr3, 2)."<br/>".
    findIndex($arr4, 0)."<br/>";